app/controllers/comments_controller.rb

INSERT INTO "comments" ("post_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 1], ["body", "123"], ["created_at", 2017-03-04 11:41:03 UTC], ["updated_at", 2017-03-04 11:41:03 UTC]]
---
  def create
    @post.comments.create! comments_params