app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "hello world"], ["body", "1"], ["created_at", 2017-03-04 10:27:52 UTC], ["updated_at", 2017-03-04 10:27:52 UTC]]