app/controllers/tickets_controller.rb

  def create
    @ticket = current_user.tickets.new(ticket_params)

    respond_to do |format|
      if @ticket.save
---
INSERT INTO "tickets" ("title", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Ой ой ой "], ["body", "что случилось та"], ["user_id", 1], ["created_at", 2017-03-05 12:23:38 UTC], ["updated_at", 2017-03-05 12:23:38 UTC]]